src/test/resources/sample-requests/IF10_ProjectData_Request.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://schemas.microsoft.com/dynamics/2008/01/services" xmlns:quer="http://schemas.microsoft.com/dynamics/2006/02/documents/QueryCriteria">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:PORProjectDataServiceFindRequest>
         <!--Optional:-->
         <quer:QueryCriteria>
            <quer:CriteriaElement>
               <quer:DataSourceName>ProjTable</quer:DataSourceName>
               <quer:FieldName>ProjId</quer:FieldName>
               <quer:Operator>NotEqual</quer:Operator>
               <quer:Value1> </quer:Value1>
               <!--Optional:-->
               <quer:Value2>?</quer:Value2>
            </quer:CriteriaElement>
         </quer:QueryCriteria>
      </ser:PORProjectDataServiceFindRequest>
   </soapenv:Body>
</soapenv:Envelope>